<h2>關於我們</h2>
    <p class="indent1">
        本專題製作利用虛擬實境開發一套可模擬四軸無人機飛行，能夠讓學生學習其運作原理，而透過卡牌排列方式使無人機進行模擬情境任務，目的於精進並且考驗學習者是否熟練於四軸無人機的操作，同時也訓練並培養學生的運算邏輯思維能力。
    </p>
<hr>
<h2>卡片系統</h2>
    <p class="indent1">
        本專題所製作的卡牌模式操控四軸無人機的情境任務可訓練學生的運算思維。<br>
        當學生面臨到需要以卡牌指令操控四軸無人機到指定地點時，學生會先思考無人機的行進路徑，該使用哪些卡牌、幾張卡牌，即是訓練學生的問題拆解能力。<br>
        而在之後學生進行模式辨別，歸類出卡牌有分起降、左轉右轉、前進後退這些重複模式，接著將行動模式進行抽象化。<br>
        例如：行動路線僅需前進加右轉、前進加左轉，起飛和降落等，最後學生將卡牌組合成排列一系列的指令，進行最後的演算法步驟。期望學生可藉此培養運算思維。
    </p>
<hr>
<h2>教學內容</h2>
    <p class="indent1">
        為了使學生能夠更加融入操作環境，選擇使用虛擬實境(Virtual Reality，VR)技術來增加使用者的模擬體驗，其擬真的畫面將會刺激學習者的學習。<br>
        而也會利用虛擬實境可將不可視之形體化為可視之特性，將平常在傳統多媒體教學過程中看不到的力學原理給展現出來，例如：四軸無人機的螺旋槳在運行時會產生的扭矩力，在現實的物理空間上是無法表現出來的，然而只要利用虛擬實境的虛擬空間，便可以將此概念視覺化，透過實體的展示以利學生在知識方面的學習。<br>
        虛擬實境的情境任務能夠提供學生沉浸式學習體驗，其即時的互動性也能給學生適當的回饋。
    </p>
<hr>
<h2>零件組裝</h2>
    <p class="indent1">
        本系統在進階關卡模式每通過一關時，會獲得一個四軸無人機的組裝零件，可在遊戲畫面左邊側欄確認所持零件，並且學習有關於此零件的知識及原理。<br>
        在通過第八關時可以進入四軸無人機的組裝關卡，學生可選擇正確的零件來組裝四軸無人機。
    </p>
<hr>