<h2>動機</h2>
    <p class="indent1">
        對於許多女生來說，使用廁所時，最怕在垃圾桶中看到沒有包好且又染有血跡的衛生棉，有時甚至會有一股難聞的血腥味，
        這樣的情況可能是在無意之中造成的，卻會帶給環境造成髒亂感，同時也影響清潔人員的工作衛生安全。
    </p>
<hr>
<h2>設計理念</h2>
    <p class="indent1">
        1. 衛生棉之沾血面將摺疊至內側，經血不會露出<br>
        2. 使用衛生棉本身特性，不消耗額外材料<br>
        3. 密封垃圾桶，以減少異味<br>
        4. 女性方便使用<br>
        5. 清潔人員可快速並乾淨的收取垃圾
    </p>
<hr>
<h2>Wingfolder天使折翼機</h2>
    <h4 class="indent1">產品介紹</h4>
        <p class="indent2">
            Wingfolder採用的方式為依據消費者想要使用的垃圾桶，為之客製化最上層卡板，協助整台機器可從垃圾桶洞口準確的放入與拿出，並於下方提供鉤子給予使用者勾住垃圾袋。<br>
            另外，由於機器需要電力才可運作，為求便利性，在設計上特別製作電池充電器，讓使用者可直接運用常見的Type C充電線完成充電。
        </p>
    <h4 class="indent1">內部結構設計</h4>
        <p class="indent2">
            主要使用壓克力、電子零件、內角鐵等材料結合雷切、3D列印、電子電路等技術製作而成。<br>
            而運作流程則為超音波感測完畢後，機器開始運轉，首先，板子往中間壓下，讓衛生棉進行第一次折疊，接著滾輪向內轉動後，讓衛生棉完成第二次折疊，並順勢掉入下方垃圾桶中。<br>
            而在機器外觀上，除了在中間採用H型的結構，同時也在外部設計成籃子式的造型，僅露出使用者需要用到的部分，讓整體機器更加穩固，且較不易受損害。
        </p>
<hr>
<h2>專題感言</h2>
    <p class="indent1">
        在整個過程中，遇到許多困境，但不管是於設計階段、製作階段，或各審查階段，都促使我們勇於去學習不會的技術、嘗試和挑戰不同的方法，也讓我們發現一項產品的出現，殊不如想像中簡單。<br>
        不過縱然其中經歷過許多挫折與迷茫，卻因有團隊的合作與陪伴、教授的悉心指導，讓這些過程成為一段有苦有甜的回憶，此後，我們會始終記住曾經的歷練，期望自己於未來的日子中，能夠將每次挑戰均視為學習，具備不避困難、不懼失敗之堅韌特質。
    </p>