<?php
    include("../../../db/db_connect.php");
    $cmd_truncate = "TRUNCATE TABLE stu_signup";
    $truncate = mysqli_query($db, $cmd_truncate);

    $stu_list = [
        ["40871119H", 1, "張睿軒"], ["40871111H", 1, "楊侑蓁"], ["40871207H", 1, "李亭萱"], ["40871209H", 1, "張雅婷"], 
        ["40871216H", 2, "傅玉凱"], ["40871228H", 2, "廖先翊"], ["40871201H", 2, "李騏語"], ["40871208H", 2, "陳亭宇"], ["40871217H", 2, "李軒騰"], 
        ["40871117H", 3, "杜伊凱"], ["40871131H", 3, "柯宗佑"], ["40871126H", 3, "張勛絜"], ["40871110H", 3, "許睿哲"], ["40771120H", 3, "陳宜峻"], 
        ["40871101H", 4, "張子濰"], ["40871122H", 4, "許聿銘"], ["40871212H", 4, "許皓陞"], ["40871215H", 4, "卓育霆"], ["40871223H", 4, "徐存昇"], 
        ["40871230H", 5, "徐翊堯"], ["40871218H", 5, "許恆齊"], ["40871225H", 5, "梁維銘"], ["40871227H", 5, "陳致愷"], ["40971901H", 5, "許嘉恩"], ["40871128H", 5, "陳威諺"], 
        ["40871222H", 6, "陳宛忻"], ["40871114H", 6, "陳安婕"], ["40871214H", 6, "郭碧玉"], ["40871210H", 6, "黃芳瑜"], ["40871129H", 6, "廖婕茹"], 
        ["40771122H", 7, "陳子珅"], ["40871133H", 7, "陳博禮"], ["40871221H", 7, "蘇可航"], ["40871905H", 7, "李娟"], ["40971904H", 7, "洪翌涵"], 
        ["40871226H", 8, "呂睿華"], ["40871206H", 8, "郭栢修"], ["40871204H", 8, "蘇柏霖"], ["40871130H", 8, "王家琪"], ["40871115H", 8, "林亭妤"], 
        ["40871123H", 9, "胡馨予"], ["40871113H", 9, "任容嫺"], ["40871127H", 9, "張育禎"], ["40871120H", 9, "劉心平"], ["40871103H", 9, "劉紹穎"], 
        ["40871231H", 10, "包欣蓉"], ["40871220H", 10, "林韋均"], ["40871213H", 10, "楊函甄"], ["40871202H", 10, "黃珮涵"], ["40871211H", 10, "潘玟琦"], 
        ["40871125H", 11, "楊汭錠"], ["40871108H", 11, "李庭伊"], ["40671114H", 11, "廖宜寬"], 
        ["40871219H", 12, "謝昊穎"], ["40871109H", 12, "黃玉澐"], ["40871124H", 12, "鄭雅中"], ["40871116H", 12, "謝秉哲"], ["40871112H", 12, "王邦旭"], 
        ["40743117S", 13, "劉又萱"], ["40871106H", 13, "曾元昊"], ["40871232H", 13, "黃家偉"]
    ];

    $codes = [0];
    for ($i = 0; $i < count($stu_list); $i++) {
        $codes[$i] = substr(sha1(md5($stu_list[$i][0] . $stu_list[$i][2])), 0, 6);
    }
    for ($i = 0; $i < count($stu_list); $i++) {
        echo $stu_list[$i][0] . " | " . $stu_list[$i][2] . " | " . $codes[$i] . "<br>";
    }
    for ($i = 0; $i < count($stu_list); $i++) {
        for ($j = 0; $j < count($stu_list); $j++) {
            if ($i == $j) {
                continue;
            }
            else if ($codes[$j] == $codes[$i]) {
                echo $j . " same as " . $i . "<br>";
            }
        }
    }
    for ($i = 0; $i < count($stu_list); $i++) {
        $id = $stu_list[$i][0];
        $group_id = $stu_list[$i][1];
        $name = $stu_list[$i][2];
        $code = $codes[$i];
        $cmd_insert = "INSERT INTO stu_signup (id, group_id, name, code) VALUES ('$id', '$group_id', '$name', '$code')";
        $insert = mysqli_query($db, $cmd_insert);
    }
    // echo '<script type="text/javascript">
    //        window.location = "./check_code.php"
    //   </script>';
?>