<h2>製作進位制轉換教學的動機</h2>
    <p class="indent1">
        進位制換算是學習計算機課程的基礎入門，但教學的方式不外乎是老師台上講述，學生台下聽課與寫題目練習，因此想嘗試使用遊戲的方式讓學習者可以在玩樂中學習進制轉換的概念，讓玩家在趣味的競技互動中提升學習興致。<br>
        在遊戲中除了有AR輔助協助了解計算外，本產品也另設有學習影片，使初學者也能簡單上手，用輕鬆的方式學習進位制轉換。
    </p>
<hr>
<h2>桌遊製作歷程</h2>
    <p class="indent1">
        在學習進位制換算的經驗中，學生們普遍認為其概念抽象且無趣，因此我們決定開發一款桌遊，結合擴增實境來輔助學習。<br>
        透過不斷地試玩，才能夠將整體逐步優化，包含了元件的設計、規則的合理性、擴增實境的運作等。<br>
        而過程中，難免會遇到瓶頸，所幸我們都能在透過討論及嘗試各種方法後，將問題順利地解決。
    </p>
<hr>
<h2>Deciverse元件介紹</h2>
    <h4 class="indent1">共同使用物件</h4>
        <p class="indent2">
            進位幣、計分幣、NFT、D幣、地圖、骰子
        </p>
    <h4 class="indent1">個人持有物件</h4>
        <p class="indent2">
            玩家代表物、牌架+算盤、進位條、計分架
        </p>
<hr>
<h2>Deciverse遊戲說明</h2>
    <p class="indent1">
        透過在虛擬世界的三個不同主題企業兌換現實世界的貨幣，成為贏家吧。<br>
        玩家需要透過在宇宙銀行存放二、八、或十六進位制貨幣，轉換成十進位貨幣。<br>
        回合中，也可以透過達成目標取得NFT，使用功能，或是透過在宇宙銀行使用駭客技能幣，來銷毀或掠奪他人資產，贏得遊戲，成為虛擬及真實世界財富之王！
    </p>