<h2>作品簡介</h2>
<p>市面上與雷射光相關的玩具中皆未能在玩的時候將雷射光的路徑呈現。「蜂」迴路轉 BEE THE LIGHT 以改善雷射光路徑不可見的特性為主要目標，同時為了使遊戲過程不會充滿學習的枯燥乏味感，我們加入更完整的情境及聲光回饋，以提升遊戲的沉浸感。</p>

<h2>專題動機</h2>
<p>「光」在日常生活與各年齡層的學習皆佔有一定的份量，然而光無形且不可觸碰之特性容易使孩童在學習時難以理解。我們認為若能將「光的路徑」可視化，將有助於孩童學習。因此我們希望設計一款能將雷射光顯現出來的益智玩具，藉由讓孩童在遊戲中看見光的路徑，進而具體觀察到光的折射與反射。</p>

<h2>理念特色</h2>
<p>
    讓遊玩「蜂」迴路轉 BEE THE LIGHT的玩家，能夠更容易的理解光反射的現象與平面空間的邏輯思維之外，也能在遊戲的過程有良好的沉浸式體驗。<br>
    1. 雷射光可視化：透過水霧滿足廷德爾效應條件後，雷射光即可視。<br>
    2. 情境設計：以蜜蜂採蜜回家路途中遇到的各種障礙困難彎彎繞繞的過程發想而成。隨後會研發故事卡，將故事與關卡卡片結合，達到同時閱讀的效果，以增進遊戲的沉浸感。<br>
    3. 聲光回饋：以光敏電阻作為感光元件並連結其他電子零件，終點被照射到雷射光時發出聲光回饋。
</p>

