<h3>心路歷程</h3>
    <p class="indent1">
        最初在選擇專題主題時可以說是經歷了風風雨雨，不斷揣摩玩家的期待以及設計意想不到的謎底，試圖讓產品更加有趣。<br>
        我們應用了大一到大四所學習的各項技術，實際整合了機構學、光固化、AR、程式設計、手工藝、電繪等技術。儘管辛苦，但這個從無到有，創造產品並優化的過程，都是很有價值的經驗，相信會成為我們成長的養分。
    </p>
<hr>
<h3>給老師的話</h3>
    <p class="indent1">
        感謝佑宏老師給我們的支持，除了在專題上給予許多有幫助的建議與材料支援外，也關心我們組員間的和睦相處。<br>
        「做完專題也要是好朋友喔！」簡單卻有溫度的叮嚀，提醒我們專注於作品之外，一起努力的過程，也會成為大學的美好回憶。<br>
        老師之於我們，不只是專題的指導者，更是我們大四生活的一盞明燈啊！愛老師喔～～～&hearts;
    </p>
<hr>
<h3>產品理念</h3>
    <p class="indent1">
        在疫情的影響下，許多人會盡量避免前往密閉空間，而相對於需要待在陌生密閉空間的真實密室逃脫，這款產品能讓大家在家裡也能放心、盡興的遊玩！<br>
        隨著製作發展，我們更加強此產品的核心理念：精巧機關盒X密室逃脫，融合AR技術與實體場景，打造密室逃脫的新式玩法！
    </p>
<hr>
<h3>組員們的一句話</h3>
    <p class="indent1">
        <span style="font-weight: 900;"><i>經過產品不斷的優化，我們持續的老化，不知將來是否會肝硬化。</i></span>
    </p>
<hr>